# Pnadas dataframe

- It is like a 2D array
- It can be considered as an excel table
- It is the collection of rows and columns

# Creation of dataframe
 Syntax: pd.dataframe()

- Using a 2D list 
- Using a dictionary (Preferred)
- Using series

## Creation of DF using a 2D list

In [1]:
names = ('A', 'B', 'C', 'D', 'E', 'F')
id = [101, 102, 103, 104, 105, 106]
city = ['Bangalore','Delhi', 'Noida', 'Pune', 'Chennai', 'Hyd']

In [2]:
lst2d = [names, id, city]

In [3]:
import pandas as pd

pd.DataFrame(lst2d)

           0      1      2     3        4    5
0          A      B      C     D        E    F
1        101    102    103   104      105  106
2  Bangalore  Delhi  Noida  Pune  Chennai  Hyd

In [7]:
df = pd.DataFrame(lst2d).T  #Transpose
df

   0    1          2
0  A  101  Bangalore
1  B  102      Delhi
2  C  103      Noida
3  D  104       Pune
4  E  105    Chennai
5  F  106        Hyd

In [8]:
df.columns=['Name','ID', 'City']
df

  Name   ID       City
0    A  101  Bangalore
1    B  102      Delhi
2    C  103      Noida
3    D  104       Pune
4    E  105    Chennai
5    F  106        Hyd

In [10]:
#Another way of creating DF

lst = [ ['A',101, 'Bangalore'], ['B',102, 'Delhi'], ['C', 103, 'Noida'], ['D', 104, 'Pune'], ['E', 105, 'Channai'], ['F', 106, 'Hyd'] ]
pd.DataFrame(lst, columns=['Name','ID', 'City'])

  Name   ID       City
0    A  101  Bangalore
1    B  102      Delhi
2    C  103      Noida
3    D  104       Pune
4    E  105    Channai
5    F  106        Hyd

## Creation of DF using a dictionary

- keys of dict becomes column names in a dataframe

In [11]:
emp={'Name':['A', 'B', 'C', 'D', 'E', 'F'], 
     'ID': [101, 102, 103, 104, 105, 106],
     'City': ['Bangalore','Delhi', 'Noida', 'Pune', 'Chennai', 'Hyd']
     }

In [12]:
empdf = pd.DataFrame(emp)
empdf

  Name   ID       City
0    A  101  Bangalore
1    B  102      Delhi
2    C  103      Noida
3    D  104       Pune
4    E  105    Chennai
5    F  106        Hyd

## Creation of DF using a series

In [16]:
# names = ('A', 'B', 'C', 'D', 'E', 'F')
# id = [101, 102, 103, 104, 105, 106]
# city = ['Bangalore','Delhi', 'Noida', 'Pune', 'Chennai', 'Hyd']

s1 = pd.Series(['A', 'B', 'C', 'D', 'E', 'F'])
s1.name = 'EmpNames'
s1

s2 = pd.Series([101, 102, 103, 104, 105, 106])

In [18]:
# When creating muktiple series, use them within a container. If not second series will become column name
# if series name is defined, no need to define column name for dataframe
emp_df = pd.DataFrame([s1, s2])
emp_df

             0    1    2    3    4    5
EmpNames     A    B    C    D    E    F
Unnamed 0  101  102  103  104  105  106

In [17]:
emp_df = pd.DataFrame([s1, s2]).T
emp_df

  EmpNames Unnamed 0
0        A       101
1        B       102
2        C       103
3        D       104
4        E       105
5        F       106

In [19]:
type(emp_df)

pandas.core.frame.DataFrame

In [20]:
type(s1)

pandas.core.series.Series